src_Extension/Reports/Расш1_Плановая_калькуляция_сквозная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>Расш1_Плановая_калькуляция_сквозная</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументВладелец</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлановаяКалькуляция2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РесурснаяСпецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src_Extension/Reports/Расш1_Плановая_калькуляция_сквозная/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	//тут ДокументВладелец передается из формы в параметры, сообщения линтера ложные
	ДокументВладелец = Параметры.ДокументВладелец;
			
КонецПроцедуры     

&НаКлиенте
Процедура ПриОткрытии(Отказ)   
	
    Отчет.ДокументВладелец = ДокументВладелец; //ВладелецФормы.Объект.Ссылка;
    
    // Формируем отчет только если передан параметр СформироватьПриОткрытии
    Если Параметры.Свойство("СформироватьПриОткрытии") И Параметры.СформироватьПриОткрытии Тогда
        // Обновляем параметры компоновки данных из реквизитов формы
        ОбновитьПараметрыКомпоновкиНаСервере();
        СкомпоноватьРезультат();
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтчетОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	// Обработка расшифровки для всех полей отчета
	Попытка
		МодульИнтеграция = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияПодсистемБСПКлиент");
		МодульИнтеграция.ПриОбработкеРасшифровки(ЭтотОбъект, Элемент, Расшифровка, СтандартнаяОбработка);
	Исключение
		Возврат;
	КонецПопытки;
	
	Попытка
		МодульОтчеты = ОбщегоНазначенияКлиент.ОбщийМодуль("ОтчетыКлиентПереопределяемый");
		МодульОтчеты.ОбработкаРасшифровки(ЭтотОбъект, Элемент, Расшифровка, СтандартнаяОбработка);
	Исключение
		Возврат;
	КонецПопытки;
	
	Если СтандартнаяОбработка Тогда
		// Стандартная обработка расшифровки
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОбработкаВыбора(Элемент, ВыбраннаяОбласть, СтандартнаяОбработка)
	
	// Обработка двойного клика или Enter на ячейке
	// Используем стандартную обработку расшифровки через БСП
	Попытка
		МодульОтчеты = ОбщегоНазначенияКлиент.ОбщийМодуль("ОтчетыКлиентПереопределяемый");
		МодульОтчеты.ОбработкаВыбораТабличногоДокумента(ЭтотОбъект, Элемент, ВыбраннаяОбласть, СтандартнаяОбработка);
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	// Обновляем документ-владелец перед формированием
	Отчет.ДокументВладелец = ДокументВладелец;
	
	// Обновляем параметры компоновки данных из реквизитов формы
	ОбновитьПараметрыКомпоновкиНаСервере();
	
	СкомпоноватьРезультат();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПараметрыКомпоновкиНаСервере()
	
	// Обновляем параметры компоновки данных из реквизитов формы
	// Устанавливаем параметры через стандартный метод БСП
	Попытка
		Если ЗначениеЗаполнено(Отчет.Номенклатура) Тогда
			КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Отчет.КомпоновщикНастроек, "Номенклатура", Отчет.Номенклатура);
		Иначе
			КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Отчет.КомпоновщикНастроек, "Номенклатура", Неопределено);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Отчет.РесурснаяСпецификация) Тогда
			КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Отчет.КомпоновщикНастроек, "РесурснаяСпецификация", Отчет.РесурснаяСпецификация);
		Иначе
			КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Отчет.КомпоновщикНастроек, "РесурснаяСпецификация", Неопределено);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Отчет.Количество) И Отчет.Количество > 0 Тогда
			КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Отчет.КомпоновщикНастроек, "Количество", Отчет.Количество);
		Иначе
			КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Отчет.КомпоновщикНастроек, "Количество", 1);
		КонецЕсли;
	Исключение
		Сообщить("Ошибка установки параметров компоновки: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент) 
	НоменклатураПриИзмененииНаСервере(Отчет.Номенклатура);	
КонецПроцедуры   

&НаСервере
Процедура НоменклатураПриИзмененииНаСервере(Номенклатура) 
	Отчет.РесурснаяСпецификация = Расш1_ОбщийМодуль1.ПриоритетнаяСпецификация(Номенклатура);
КонецПроцедуры   


&НаКлиенте
Процедура РесусрнаяСпецификацияПриИзменении(Элемент)   
	РесусрнаяСпецификацияПриИзмененииНаСервере(Отчет.РесурснаяСпецификация);
КонецПроцедуры    

&НаСервере
Процедура РесусрнаяСпецификацияПриИзмененииНаСервере(РесурснаяСпецификация)
	Отчет.Номенклатура = Расш1_ОбщийМодуль1.НоменклатураПоСпецификации(РесурснаяСпецификация);
КонецПроцедуры
